Repository: jonathanzerox/helpothers
Catalog: helpothers/locale/*/LC_MESSAGES/django.po
Languages: sl

source: My profile
sl: Moj profil

source: Welcome to Help Others!
sl: Dobrodošli v Help Others

source: Gathering centers
sl: Zbirni centri

source: Add a gathering center
sl: Dodaj zbirni center

source: Resources
sl: Viri

source: Suggest a resource
sl: Predlagaj nov vir

source: About Help Others
sl: Kaj je Help Others

source: Log in
sl: Vpiši se

source: Log in with Facebook
sl: Vpiši se s Facebook računom

source: Log in with Twitter
sl: Vpiši se s Twitter računom

source: About
sl: Podrobnosti

source: Log out
sl: Odjavi se

source: Language
sl: Jezik

source: A collection of up to date and relevant resources on how to help the refugees
sl: Zbirka aktualnih in relevantnih podatkov, novic, napotkov v zvezi z begunci

source: City
sl: Mesto

source: Cities
sl: Mesta

source: If this center has any special name
sl: Ali ima to zbirališče kakšno posebno ime

source: Any additional information about this specific gathering center
sl: Dodatne informacije o tem zbirnem centru

source: Name
sl: Ime

source: Description
sl: Opis

source: Most Needed
sl: Najbolj potrebno

source: Contact
sl: Kontakt

source: Add new gathering center
sl: Dodaj nov zbirni center

source: Add
sl: Dodaj

source: Edit this Resource
sl: Uredi vir

source: Resource added
sl: Vir dodan

source: Thanks!
sl: Hvala!

source: Thank you for your submission. We'll review it as soon as possible.
sl: Hvala za Vaš prispevek. Pregledali ga bomo v najkrajšem možnem času.
